fixture/vcr_cassettes/non-existent_cep_-_correios.json

[
  {
    "request": {
      "body": "<?xml version=\"1.0\" encoding=\"UTF-8\"?>\n<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:cli=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">\n  <soapenv:Header />\n  <soapenv:Body>\n    <cli:consultaCEP>\n      <cep>00000000</cep>\n    </cli:consultaCEP>\n  </soapenv:Body>\n</soapenv:Envelope>\n",
      "headers": [],
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente"
    },
    "response": {
      "body": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><soap:Fault><faultcode>soap:Server</faultcode><faultstring>CEP NAO ENCONTRADO</faultstring><detail><ns2:SigepClienteException xmlns:ns2=\"http://cliente.bean.master.sigep.bsb.correios.com.br/\">CEP NAO ENCONTRADO</ns2:SigepClienteException></detail></soap:Fault></soap:Body></soap:Envelope>",
      "headers": {
        "Date": "Mon, 21 Mar 2016 02:27:31 GMT",
        "Content-Type": "text/xml;charset=ISO-8859-1",
        "Content-Length": "369",
        "Vary": "Accept-Encoding,User-Agent",
        "Connection": "close"
      },
      "status_code": 500,
      "type": "ok"
    }
  }
]